consent-management/consent-management-lib/src/test/resources/json/service/mapper/pis-payment.json

{
  "paymentId": "2Cixxv85Or_qoBBh_d7VTZC0M8PwzR5IGzsJuT-jYHNOMR1D7n69vIF46RgFd7Zn_=_bS6p6XvTWI",
  "endToEndIdentification": "RI-123456789",
  "instructionIdentification" : "ABC/4562/2020-01-10",
  "ultimateDebtor": "Mueller",
  "debtorAccount": {
    "aspspAccountId": "1234567890",
    "resourceId": "3276159a-27ad-46db-8491-71e629d82baa",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "pan": "1111",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "currency": "EUR"
  },
  "currency": "EUR",
  "amount": 1000.00,
  "creditorAccount": {
    "aspspAccountId": "1234567890",
    "resourceId": "3276159a-27ad-46db-8491-71e629d82baa",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "pan": "1111",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "currency": "EUR"
  },
  "creditorAgent": "BCENECEQ",
  "creditorName": "Telekom",
  "creditorAddress": {
    "streetName": "WBG Straße",
    "buildingNumber": "56",
    "townName": "Nürnberg",
    "postCode": "90543",
    "country": "DE"
  },
  "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222",
  "remittanceInformationStructured": {
    "reference": "Ref Number Merchant",
    "referenceType": "reference type",
    "referenceIssuer": "reference issuer"
  },
  "purposeCode": "BCENECEQ",
  "transactionStatus": "ACCP",
  "executionRule": "following",
  "frequency": "ANNUAL",
  "dayOfExecution": "14",
  "batchBookingPreferred": false,
  "requestedExecutionDate": "2020-01-01",
  "requestedExecutionTime": "2020-01-01T15:30:35.035Z",
  "startDate": "2020-01-01",
  "endDate": "2020-03-03"
}
